doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application       chtMultiRegionFoam;

startFrom         latestTime;

startTime         0.001;

stopAt            endTime;

endTime           75;

deltaT            0.001;

writeControl      adjustable;

writeInterval     15;

purgeWrite        0;

writeFormat       ascii;

writePrecision    7;

writeCompression  off;

timeFormat        general;

timePrecision     6;

runTimeModifiable  true;

maxCo             0.3;

maxDi             10.0;

adjustTimeStep    yes;
