doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale    1;

vertices
(
    (-0.1 -0.04 -0.05)
    (0.1 -0.04 -0.05)
    (0.1 0.04 -0.05)
    (-0.1 0.04 -0.05)
    (-0.1 -0.04 0.05)
    (0.1 -0.04 0.05)
    (0.1 0.04 0.05)
    (-0.1 0.04 0.05)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 10 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    maxY
    {
        type    wall;
        faces
        (
            (3 7 6 2)
        );
    }
    minX
    {
        type    patch;
        faces
        (
            (0 4 7 3)
        );
    }
    maxX
    {
        type    patch;
        faces
        (
            (2 6 5 1)
        );
    }
    minY
    {
        type    wall;
        faces
        (
            (1 5 4 0)
        );
    }
    minZ
    {
        type    wall;
        faces
        (
            (0 3 2 1)
        );
    }
    maxZ
    {
        type    wall;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(

);
