doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh   true;

snap              true;

addLayers         false;

geometry
{
    geom.stl
    {
        type    triSurfaceMesh;
        name    geom;
    }
}

castellatedMeshControls
{
    maxLocalCells           100000;
    maxGlobalCells          2000000;
    minRefinementCells      10;
    nCellsBetweenLevels     2;
    features
    (
        {
            file     "geom.extendedFeatureEdgeMesh";
            level    1;
        }
    );
    refinementSurfaces
    {
        geom
        {
            level
            (
                1
                1
            );
        }
    }
    resolveFeatureAngle     30;
    refinementRegions
    {
    }
    locationsInMesh
    (
        ((0.005 0.005 0.005) heater)
        ((0.05 0.005 0.005) rightSolid)
        ((-0.05 0.005 0.005) leftSolid)
        ((-0.05 0.015 0.005) topAir)
        ((-0.05 -0.015 0.005) bottomAir)
    );
    allowFreeStandingZoneFaces  false;
}

snapControls
{
    nSmoothPatch        3;
    tolerance           1.0;
    nSolveIter          30;
    nRelaxIter          5;
    nFeatureSnapIter    10;
}

addLayersControls
{
    relativeSizes           true;
    layers
    {
        maxY
        {
            nSurfaceLayers    3;
        }
    }
    expansionRatio          1.3;
    finalLayerThickness     1;
    minThickness            0.1;
    nGrow                   0;
    featureAngle            30;
    nRelaxIter              3;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        2;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio  1;
    minMedialAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
}

meshQualityControls
{
    #include  "meshQualityDict";
    nSmoothScale            4;
    errorReduction          0.75;
}

mergeTolerance    1e-06;
