doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/constant/bottomAir/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType    laminar;
