doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/constant/bottomAir/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

thermoType
{
    type               heRhoThermo;
    mixture            pureMixture;
    transport          const;
    thermo             hConst;
    equationOfState    perfectGas;
    specie             specie;
    energy             sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight    28.9;
    }
    thermodynamics
    {
        Cp    1000;
        Hf    0;
    }
    transport
    {
        mu    1.8e-05;
        Pr    0.7;
    }
}
