doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/constant/heater/radiationProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      radiationProperties;
}

radiation         off;

radiationModel    none;
