doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/constant/heater/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

thermoType
{
    type               heSolidThermo;
    mixture            pureMixture;
    transport          constIso;
    thermo             hConst;
    equationOfState    rhoConst;
    specie             specie;
    energy             sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight    12;
    }
    transport
    {
        kappa    80;
    }
    thermodynamics
    {
        Hf    0;
        Cp    450;
    }
    equationOfState
    {
        rho    8000;
    }
}
