doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/constant/regionProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      regionProperties;
}

regions
(
    fluid
    (bottomAir topAir)
    solid
    (heater leftSolid rightSolid)
);
