doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions       [1 -1 -2 0 0 0 0];

internalField    uniform 100000.0;

boundaryField
{
    #includeEtc  "caseDicts/setConstraintTypes";
    ".*"
    {
        type     calculated;
        value    $internalField;
    }
}
