doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions       [0 0 0 1 0 0 0];

internalField    uniform 300;

boundaryField
{
    #includeEtc  "caseDicts/setConstraintTypes";
    ".*"
    {
        type     calculated;
        value    $internalField;
    }
}
