doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions       [0 2 -2 0 0 0 0];

internalField    uniform 0.1;

boundaryField
{
    #includeEtc  "caseDicts/setConstraintTypes";
    ".*"
    {
        type     calculated;
        value    $internalField;
    }
}
