doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/0/rho
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}

dimensions       [1 -3 0 0 0 0 0];

internalField    uniform 8000;

boundaryField
{
    #includeEtc  "caseDicts/setConstraintTypes";
    ".*"
    {
        type     calculated;
        value    $internalField;
    }
}
