doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/system/bottomAir/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default    Euler;
}

gradSchemes
{
    default    Gauss linear;
}

divSchemes
{
    default                 none;
    div(phi,U)              Gauss upwind;
    energy                  Gauss upwind;
    div(phi,K)              Gauss linear;
    div(phi,h)              $energy;
    turbulence              Gauss upwind;
    div(phi,k)              $turbulence;
    div(phi,epsilon)        $turbulence;
    div(phi,R)              $turbulence;
    div(R)                  Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U)))))  Gauss linear;
}

laplacianSchemes
{
    default    Gauss linear corrected;
}

interpolationSchemes
{
    default    linear;
}

snGradSchemes
{
    default    corrected;
}
