doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/system/heater/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default    Euler;
}

gradSchemes
{
    default    Gauss linear;
}

divSchemes
{
    default    none;
}

laplacianSchemes
{
    default               none;
    laplacian(alpha,h)    Gauss linear corrected;
}

interpolationSchemes
{
    default    linear;
}

snGradSchemes
{
    default    corrected;
}
