doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

PIMPLE
{
    nOuterCorrectors    1;
}
