doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/system/rightSolid/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    h
    {
        solver            PCG;
        preconditioner    DIC;
        tolerance         1e-06;
        relTol            0.1;
    }
    hFinal
    {
        $h;
        tolerance    1e-06;
        relTol       0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors  0;
}
