doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/system/topAir/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    "(rho|rhoFinal)"
    {
        solver            PCG;
        preconditioner    DIC;
        tolerance         1e-07;
        relTol            0;
    }
    p_rgh
    {
        solver       GAMG;
        tolerance    1e-07;
        relTol       0.01;
        smoother     GaussSeidel;
    }
    p_rghFinal
    {
        $p_rgh;
        tolerance    1e-07;
        relTol       0;
    }
    "(U|h|k|epsilon|R)"
    {
        solver            PBiCGStab;
        preconditioner    DILU;
        tolerance         1e-07;
        relTol            0.1;
    }
    "(U|h|k|epsilon|R)Final"
    {
        $U;
        tolerance    1e-07;
        relTol       0;
    }
}

PIMPLE
{
    momentumPredictor       yes;
    nCorrectors             2;
    nNonOrthogonalCorrectors  0;
    pRefCell                0;
    pRefValue               100000.0;
}

relaxationFactors
{
    equations
    {
        "h.*"    1;
        "U.*"    1;
    }
}
