doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains  4;

method            scotch;

regions
{
    heater
    {
        numberOfSubdomains    1;
        method                simple;
        coeffs
        {
            n
            (
                1
                1
                1
            );
        }
    }
}
