doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/system/decomposeParDict.6
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains  6;

method            scotch;
