doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/system/leftSolid/changeDictionaryDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}

boundary
{
    minZ
    {
        type    patch;
    }
    maxZ
    {
        type    patch;
    }
}

T
{
    internalField    uniform 300;
    boundaryField
    {
        ".*"
        {
            type     zeroGradient;
            value    uniform 300;
        }
        "procBoundary.*"
        {
            type    processor;
        }
        "leftSolid_to_.*"
        {
            type           compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr           T;
            kappaMethod    solidThermo;
            value          uniform 300;
        }
    }
}
