doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/system/meshQualityDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}

#includeEtc  "caseDicts/meshQualityDict";
