doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/system/surfaceFeatureExtractDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}

geom.stl
{
    extractionMethod        extractFromSurface;
    includedAngle           150;
    writeFeatureEdgeMesh    yes;
    writeObj                yes;
}
