doc/examples/fluidsimfoam-multi-region-snappy/tests/saved_cases/case0/system/topAir/changeDictionaryDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}

U
{
    internalField uniform
    (
        0.1
        0
        0
    );
    boundaryField
    {
        ".*"
        {
            type    fixedValue;
            value uniform
            (
                0
                0
                0
            );
        }
        "procBoundary.*"
        {
            type    processor;
        }
        minX
        {
            type    fixedValue;
            value uniform
            (
                0.1
                0
                0
            );
        }
        maxX
        {
            type    inletOutlet;
            inletValue uniform
            (
                0
                0
                0
            );
            value uniform
            (
                0.1
                0
                0
            );
        }
    }
}

T
{
    internalField    uniform 300;
    boundaryField
    {
        ".*"
        {
            type    zeroGradient;
        }
        "procBoundary.*"
        {
            type    processor;
        }
        minX
        {
            type     fixedValue;
            value    uniform 300;
        }
        maxX
        {
            type          inletOutlet;
            inletValue    uniform 300;
            value         uniform 300;
        }
        "topAir_to_.*"
        {
            type           compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr           T;
            kappaMethod    fluidThermo;
            value          uniform 300;
        }
    }
}

epsilon
{
    internalField    uniform 0.01;
    boundaryField
    {
        ".*"
        {
            type     epsilonWallFunction;
            value    uniform 0.01;
        }
        "procBoundary.*"
        {
            type    processor;
        }
        minX
        {
            type     fixedValue;
            value    uniform 0.01;
        }
        maxX
        {
            type          inletOutlet;
            inletValue    uniform 0.01;
            value         uniform 0.01;
        }
    }
}

k
{
    internalField    uniform 0.1;
    boundaryField
    {
        ".*"
        {
            type     kqRWallFunction;
            value    uniform 0.1;
        }
        "procBoundary.*"
        {
            type    processor;
        }
        minX
        {
            type     fixedValue;
            value    uniform 0.1;
        }
        maxX
        {
            type          inletOutlet;
            inletValue    uniform 0.1;
            value         uniform 0.1;
        }
    }
}

p_rgh
{
    internalField    uniform 100000.0;
    boundaryField
    {
        ".*"
        {
            type     fixedFluxPressure;
            value    uniform 100000.0;
        }
        "procBoundary.*"
        {
            type    processor;
        }
        maxX
        {
            type     fixedValue;
            value    uniform 100000.0;
        }
    }
}

p
{
    internalField    uniform 100000.0;
    boundaryField
    {
        ".*"
        {
            type     calculated;
            value    uniform 100000.0;
        }
        "procBoundary.*"
        {
            type    processor;
        }
        maxX
        {
            type     calculated;
            value    uniform 100000.0;
        }
    }
}
